import pandas as pd

# สร้าง DataFrame จากข้อมูล
data = {
    'Date': ['2023-01-30', '2023-01-31', '2023-02-01', '2023-02-02', '2023-02-05', '2023-02-06', '2023-02-07', '2023-02-08', '2023-02-09', '2023-02-12', '2023-02-13', '2023-02-14', '2023-02-15', '2023-02-16', '2023-02-19', '2023-02-20', '2023-02-21', '2023-02-22', '2023-02-23', '2023-02-26'],
    'Open': [33.25, 33.25, 33.00, 33.00, 32.75, 32.75, 32.75, 32.75, 32.25, 32.25, 32.50, 32.50, 32.75, 32.50, 33.50, 33.00, 33.00, 32.75, 32.50, 32.25],
    'Close': [33.25, 33.25, 33.00, 33.00, 32.75, 32.50, 32.75, 32.50, 32.50, 32.25, 32.75, 32.75, 32.75, 33.50, 33.00, 33.25, 32.75, 32.25, 32.50, 32.00]
}

df = pd.DataFrame(data)

# แปลงชนิดข้อมูลของคอลัมน์ 'Date' เป็น datetime
df['Date'] = pd.to_datetime(df['Date'])

# กลุ่มข้อมูลตามความถี่ 'W-MON' และคำนวณค่าเฉลี่ยของ 'Open' และ 'Close'
mon_fri_data = df.groupby(pd.Grouper(key='Date', freq='W-FRI')).agg({'Open': 'first', 'Close': 'last'})
# agg สามารถระบุ max กับ min ได้ด้วย
# แสดงผลลัพธ์
print(mon_fri_data)

'''
กรณีข้อมูลในหนึ่งสัปดาห์มีไม่ครบเช่น mon , tue , thu Grouper จะสร้างวันศุกร์ของสัปดาห์นั้นขึ้นมาใหม่ และ ลงข้อมูลของ agg เช่น first , last ลงไป 
'''